
## Plan Result




<pre><code>Plan: 6 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES-PASS-V14
  * azurerm_key_vault_secret.POSTGRES-USER-V14
  * azurerm_key_vault_secret.POSTGRES_DATABASE-V14
  * azurerm_key_vault_secret.POSTGRES_HOST-V14
  * azurerm_key_vault_secret.POSTGRES_PORT-V14
  * module.db-v14.null_resource.set-user-permissions-additionaldbs[&#34;emstitch&#34;]
* Update
  * module.db-v11.azurerm_postgresql_server.postgres-paas
  * module.local_key_vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS-V14 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS-V14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-stitching-aat/providers/Microsoft.KeyVault/vaults/em-stitching-aat"
      + name                    = "stitching-POSTGRES-PASS-V14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER-V14 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER-V14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-stitching-aat/providers/Microsoft.KeyVault/vaults/em-stitching-aat"
      + name                    = "stitching-POSTGRES-USER-V14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE-V14 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_DATABASE-V14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-stitching-aat/providers/Microsoft.KeyVault/vaults/em-stitching-aat"
      + name                    = "stitching-POSTGRES-DATABASE-V14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST-V14 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_HOST-V14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-stitching-aat/providers/Microsoft.KeyVault/vaults/em-stitching-aat"
      + name                    = "stitching-POSTGRES-HOST-V14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT-V14 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_PORT-V14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-stitching-aat/providers/Microsoft.KeyVault/vaults/em-stitching-aat"
      + name                    = "stitching-POSTGRES-PORT-V14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.db-v11.azurerm_postgresql_server.postgres-paas will be updated in-place
  ~ resource "azurerm_postgresql_server" "postgres-paas" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-stitching-postgres-db-v11-data-aat/providers/Microsoft.DBforPostgreSQL/servers/em-stitching-postgres-db-v11-aat"
        name                              = "em-stitching-postgres-db-v11-aat"
        tags                              = {
            "application"         = "evidence-management"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/em-stitching-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#em-dev-chat"
            "environment"         = "staging"
            "managedBy"           = "Evidence Management"
        }
        # (16 unchanged attributes hidden)

      - threat_detection_policy {
          - disabled_alerts      = [] -> null
          - email_account_admins = false -> null
          - email_addresses      = [] -> null
          - enabled              = true -> null
          - retention_days       = 0 -> null
        }
    }

  # module.db-v14.null_resource.set-user-permissions-additionaldbs["emstitch"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS CFT DB Access Reader"
          + "name"           = "em-stitching-postgres-db-v14"
          + "script_hash"    = "f1b050abe4f2e8fc188c106259b04ba5034688164070e5ebb3e10137ad569f93"
        }
    }

  # module.local_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-stitching-aat/providers/Microsoft.KeyVault/vaults/em-stitching-aat|em-stitching-aat"
        name                           = "em-stitching-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 6 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1813,"Program":"tfcmt","SHA1":"","Vars":{}} -->